In [24]:
# conda install sqlalchemy
# conda install lxml
# conda install html5lib
# conda install BeautifulSoup4

In [25]:
import pandas as pd

In [26]:
pwd

'C:\\Users\\filda\\Desktop\\Udemy Course 3\\Section 6 Python for Data analysis - Pandas'

In [27]:
import pandas as pd

In [28]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [29]:
df=pd.read_csv('example.csv')

In [30]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [31]:
df.to_csv('My_output',index=False)

In [32]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [38]:
pd.read_excel('Excel_Sample.xlsx')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [39]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')

In [42]:
data=pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [43]:
type(data)

list

In [45]:
data[0].head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
1,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
2,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
3,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
4,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539

In [46]:
from sqlalchemy import create_engine

In [48]:
engine=create_engine('sqlite:///:memory:')

In [49]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [51]:
df.to_sql('my_table',engine)

4

In [54]:
sqldf=pd.read_sql('my_table',con=engine)

In [55]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15